fdr/src/test/resources/requests/nodoVerificaRPT.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns5:nodoVerificaRPT xmlns:ns2="http://www.digitpa.gov.it/schemas/2011/Pagamenti/"
                             xmlns:ns3="http://PuntoAccessoPSP.spcoop.gov.it/BarCode_GS1_128_Modified"
                             xmlns:ns4="http://PuntoAccessoPSP.spcoop.gov.it/QrCode"
                             xmlns:ns5="http://ws.pagamenti.telematici.gov/">
            <identificativoPSP>{psp}</identificativoPSP>
            <identificativoIntermediarioPSP>{brokerPsp}</identificativoIntermediarioPSP>
            <identificativoCanale>{channel}</identificativoCanale>
            <password>{channelPwd}</password>
            <codiceContestoPagamento>{ccp}</codiceContestoPagamento>
            <codificaInfrastrutturaPSP>QR-CODE</codificaInfrastrutturaPSP>
            <codiceIdRPT>
                <ns4:QrCode>
                    <ns4:CF>{pa}</ns4:CF>
                    <ns4:CodStazPA>02</ns4:CodStazPA>
                    <ns4:AuxDigit>0</ns4:AuxDigit>
                    <ns4:CodIUV>{iuv}</ns4:CodIUV>
                </ns4:QrCode>
            </codiceIdRPT>
        </ns5:nodoVerificaRPT>
    </soap:Body>
</soap:Envelope>